RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_fac.c
    /* disable read and write interrupt */
    fac_interrupt_disable(FAC_CTL_RIE | FAC_CTL_WIE);

    /* disable read and write dma */
    fac_dma_disable(FAC_DMA_READ);
    fac_dma_disable(FAC_DMA_WRITE);

    /* reset register and pointer */
    FAC_CTL |= FAC_CTL_RST;
}

/*!
    \brief      FAC write data with fixed point format (API_ID(0x0017U))
    \param[in]  data: 16-bit data
    \param[out] none
    \retval     none
*/
void fac_fixed_data_write(int16_t data)
{
    FAC_WDATA_INT = (int16_t)data;
}

/*!
    \brief      FAC read data with fixed point format (API_ID(0x0018U))
    \param[in]  none
    \param[out] none
    \retval     16-bit data
*/
int16_t fac_fixed_data_read(void)
{
    int16_t value;
    value = (int16_t)FAC_RDATA_INT;
    return value;
}

/*!
    \brief      FAC write data with float point format (API_ID(0x0019U))
    \param[in]  data: 16-bit data
    \param[out] none
    \retval     none
*/
void fac_float_data_write(float data)
{
    FAC_WDATA_FLOAT = (float)data;
}

/*!
    \brief      FAC read data with fixed point format (API_ID(0x001AU))
    \param[in]  none
    \param[out] none
    \retval     16-bit data
*/
float fac_float_data_read(void)
{
    float value;
    value = (float)FAC_RDATA_FLOAT;
    return value;
}

/*!
    \brief      enable the FAC Interrupt (API_ID(0x001BU))
    \param[in]  interrupt: FAC Interrupt
                only one parameter can be selected which is shown as below:
      \arg        FAC_CTL_RIE: Read buffer interrupt
      \arg        FAC_CTL_WIE: Write buffer interrupt
      \arg        FAC_CTL_OFEIE: Overflow error interrupt
      \arg        FAC_CTL_UFEIE: Underflow error interrupt
      \arg        FAC_CTL_STEIE: Saturation error interrupt
      \arg        FAC_CTL_GSTEIE: gain saturation error interrupt
    \param[out] none
    \retval     none
*/
void fac_interrupt_enable(uint32_t interrupt)
{
    FAC_CTL |= interrupt;
}

/*!
    \brief      disable the FAC Interrupt (API_ID(0x001CU))
    \param[in]  interrupt: FAC Interrupt
                only one parameter can be selected which is shown as below:
      \arg        FAC_CTL_RIE: Read buffer interrupt
      \arg        FAC_CTL_WIE: Write buffer interrupt
      \arg        FAC_CTL_OFEIE: Overflow error interrupt
      \arg        FAC_CTL_UFEIE: Underflow error interrupt
      \arg        FAC_CTL_STEIE: Saturation error interrupt
      \arg        FAC_CTL_GSTEIE: gain saturation error interrupt
    \param[out] none
    \retval     none
*/
void fac_interrupt_disable(uint32_t interrupt)
{
    FAC_CTL &= ~interrupt;
}

/*!
    \brief      get FAC interrupt flag status (API_ID(0x001DU))
    \param[in]  interrupt: FAC interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        FAC_INT_FLAG_YBEF: Y buffer read interrupt flag
      \arg        FAC_INT_FLAG_X0BFF: X0 buffer write interrupt flag
      \arg        FAC_INT_FLAG_OFEF: overflow error interrupt flag
      \arg        FAC_INT_FLAG_UFEF: underflow error interrupt flag
      \arg        FAC_INT_FLAG_STEF: saturation error interrupt flag
      \arg        FAC_INT_FLAG_GSTEF: gain saturation error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fac_interrupt_flag_get(uint8_t interrupt)
{
    uint32_t reg1 = FAC_CTL;
    uint32_t reg2 = FAC_STAT;
    FlagStatus status = RESET;
    
    switch(interrupt) {
    /*  Y buffer read interrupt */
    case FAC_INT_FLAG_YBEF:
        reg1 = reg1 & FAC_CTL_RIE;
        reg2 = (((reg2 & FAC_STAT_YBEF) == 0U) ? FAC_STAT_YBEF : 0U);
        break;
    /* X0 buffer write interrupt */
    case FAC_INT_FLAG_X0BFF:
        reg1 = reg1 & FAC_CTL_WIE;
        reg2 = (((reg2 & FAC_STAT_X0BFF) == 0U) ? FAC_STAT_X0BFF : 0U);
        break;
    /* overflow error interrupt */
    case FAC_INT_FLAG_OFEF:
        reg1 = reg1 & FAC_CTL_OFEIE;
        reg2 = reg2 & FAC_STAT_OFEF;
        break;
    /* underflow error interrupt */
    case FAC_INT_FLAG_UFEF:
        reg1 = reg1 & FAC_CTL_UFEIE;
        reg2 = reg2 & FAC_STAT_UFEF;
        break;
    /* saturation error interrupt */
    case FAC_INT_FLAG_STEF:
        reg1 = reg1 & FAC_CTL_STEIE;
        reg2 = reg2 & FAC_STAT_STEF;
        break;
    /* saturation error interrupt */
    case FAC_INT_FLAG_GSTEF:
        reg1 = reg1 & FAC_CTL_GSTEIE;
        reg2 = reg2 & FAC_STAT_GSTEF;
        break;
    default :
        break;
    }
    /*get FAC interrupt flag status */
    if(reg1 && reg2) {
        status = SET;
    } else {
        status = RESET;
    }
    return status;
}

/*!
    \brief      get FAC flag status (API_ID(0x001EU))
    \param[in]  flag: FAC flag status
                only one parameter can be selected which is shown as below:
      \arg        FAC_FLAG_YBEF: Y buffer empty flag
      \arg        FAC_FLAG_X0BFF: X0 buffer full flag
      \arg        FAC_FLAG_OFEF: overflow error flag
      \arg        FAC_FLAG_UFEF: underflow error flag
      \arg        FAC_FLAG_STEF: saturation error flag
      \arg        FAC_FLAG_GSTEF: gain saturation error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fac_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;
    if(FAC_STAT & flag) {
        status = SET;
    } else {
        status = RESET;
    }
    return status;
}

